// Яким буде результат його виклику? Чому? Опишіть як працює цей код. 
console.log('start');

const promise1 = new Promise((resolve, reject) => {
console.log(1)
resolve(2)
})

promise1.then(res => {
console.log(res)
})

console.log('end');

// спочатку відбулося виконання коду з console.log('start');,
//  потім створився новий об'єкт Promise - promise1, і відбулося виконання функції, яку ми передали як параметр у конструктор Promise. 
// У цій функції спочатку вивелось на консоль 1, 
// Нарешті, вивелось на консоль 'end', оскільки це було останнім рядком коду.
// а потім було викликано функцію resolve з параметром 2. 
// Це означає, що Promise був виконаний і значення 2 було передано як результат. Далі було викликано метод then на promise1, який дозволяє додати обробник для результату Promise.
//  У цьому обробнику ми просто вивели на консоль отриманий результат - 2. 
